Revit 2027 API
IFCGeometryInfo.CreateFaceGeometryInfo(Double, Boolean) Method
 Creates a new container object which holds IfcFace handles processed from a Revit geometry object.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCGeometryInfo CreateFaceGeometryInfo(
	double epsilon,
	bool isCoarse
)
Public Shared Function CreateFaceGeometryInfo (
	epsilon As Double,
	isCoarse As Boolean
) As IFCGeometryInfo
public:
static IFCGeometryInfo^ CreateFaceGeometryInfo(
	double epsilon,
	bool isCoarse
)
static member CreateFaceGeometryInfo :
        epsilon : float *
        isCoarse : bool -> IFCGeometryInfo
Parameters
epsilon Double
 The epsilon value used to process surfaces.
isCoarse Boolean
 Indicates whether we should use a coarse representation.
Return Value
IFCGeometryInfo
 The new geometry info container.
See Also
Reference
IFCGeometryInfo Class
CreateFaceGeometryInfo Overload
Autodesk.Revit.DB.IFC Namespace